---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotRemoveMembersInCircuitHavingParent
source: html/39dabe1e-fbcc-273d-a537-1c47f0fd82fe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotRemoveMembersInCircuitHavingParent Property

You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveMembersInCircuitHavingParent { get; }
```